{"keras_version": "2.1.5", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1]}}, {"name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 16, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2]}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [2, 2], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "beta_constraint": null, "center": true, "axis": -1, "momentum": 0.8, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [2, 2], "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_2", "beta_constraint": null, "center": true, "axis": -1, "momentum": 0.8, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}]}, {"name": "dense_1", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "dense_2", "inbound_nodes": [[["sequential_1", 1, 0, {}]]], "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]]}, "backend": "tensorflow"}