{"keras_version": "2.1.5", "class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_3", "dtype": "int32", "sparse": false, "batch_input_shape": [null, 1]}}, {"name": "embedding_1", "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Embedding", "config": {"activity_regularizer": null, "trainable": true, "embeddings_regularizer": null, "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "output_dim": 100, "input_length": null, "batch_input_shape": [null, null], "name": "embedding_1", "embeddings_constraint": null, "input_dim": 10, "mask_zero": false}}, {"name": "input_2", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_2", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 100]}}, {"name": "flatten_2", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"name": "multiply_1", "inbound_nodes": [[["input_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}}, {"name": "sequential_2", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 100], "bias_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "units": 6272, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [7, 7, 128]}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_3", "beta_constraint": null, "center": true, "axis": -1, "momentum": 0.8, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_4", "beta_constraint": null, "center": true, "axis": -1, "momentum": 0.8, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_5", "beta_constraint": null, "center": true, "axis": -1, "momentum": 0.8, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "strides": [1, 1], "filters": 1, "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}]}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["sequential_2", 1, 0]]}, "backend": "tensorflow"}